// Дни недели


let day = prompt('Введите номер дня недели от 1 до 7');
if (day == 1) {
    alert("Вы ввели" + " " + 'понедельник')
}
else if (day == 2) {
    alert("Вы ввели" + " " + 'вторник')
}
else if (day == 3) {
    alert("Вы ввели" + " " + 'среда')
}
else if (day == 4) {
    alert("Вы ввели" + " " + 'четверг')
}
else if (day == 5) {
    alert("Вы ввели" + " " + 'пятница')
}
else if (day == 6) {
    alert("Вы ввели" + " " + 'суббота')
}
else if (day == 7) {
    alert("Вы ввели" + " " + 'воскресенье')
}
else alert("Вы ввели неправильный день недели");