'use strict';

let x1 = prompt('Введите координату оси X1', 1);
let y1 = prompt('Введите координату оси Y1', 1);

if (x1 < 5 && y1 > -1 && x1 > -5 && y1 < 5) {
	alert("Точка попадает в область");
} else {
	alert("Точка НЕ попадает в область");
}


let x2 = prompt('Введите координату оси X2', 1);
let y2 = prompt('Введите координату оси Y2', 1);

if (x2 < 2 && x2 > -2 && y2 < 2 && y2 > 0 || x2 < 2 && x2 > -2 && y2 > -2 && y2 < 0) {
	alert("Точка попадает в область");
} else {
	alert("Точка НЕ попадает в область");
}

let x3 = prompt('Введите координату оси X3', 1);
let y3 = prompt('Введите координату оси Y3', 1);

if (x3 < 1 && x3 > -3 && y3 < 1 && y3 > -3 || Math.pow(x, 2) + Math.pow(y, 2) < 1) {
	alert("Точка попадает в область");
} else {
	alert("Точка НЕ попадает в область");
}